import random as rnd

a = rnd.randint(1, 100)
ct = 0  # int() тут теж можна не писати, Пайтон сам зрозуміє, що це ціле число

print("Казино відкрито! Спробуй вгадати число від 1 до 100.")

while True:
    ct += 1  # Рахуємо спробу одразу, як тільки зайшли в цикл
    b = int(input("Твоя ставка: "))

    if b < a:
        print("Малувато! Давай більше.")
    elif b > a:
        print("Забагато! Бери менше.")
    else:
        print("🎉 Бінго! Ти зірвала джекпот! Це дійсно число", a, "ти впоралась за", ct, "спроб")
        break